//
//  BlogDetailCom.swift
//  Dream Dictionary
//
//  Created by MTK on 10/10/2023.
//

import Foundation
import SwiftUI

struct BlogDetailView: View {
    let blogId: Int
    let blogTitle: String
    
    let blogDetailData_1: [(Int, String)] = [
            (1, "ကြာမျိုးငါးပါးအနံ့ကို ရှုရသည်ဟု မြင်မက်မူ တည်ကြည်စွာ ဂုဏ်သတင်းကျော်စောရအံ့။"),
            (2, "ကြာညိုပန်းကို ပန်ရသည်ဟု မြင်မက်မူ မယားကောင်းရအံ့"),
            (3, "ကြာသွတ်အိုးနှင့် ရေချိုးရသည်ဟု မြင်မက်မူ သူတစ်ပါးတို့၏မှီခိုရာဖြစ်အံ့။ ကြာသွတ်အိုးမြင်မက်မူ စည်းစိမ်များအံ့။"),
            (4, "ကြာပန်းစသည်မြင်မက်မူ ဖျားနာအံ့"),
            (5, "ကျွဲစီးရသည်ဟု မြင်မက်မူ ကျေးကျွန်ရအံ့"),
            (6, "ကျွဲ၊ နွား၊ ဝက်၊ မြေခွေး၊ လင်းတ တိရစ္ဆာန်တို့ကိုမြင်မက်မူ ဥပါဒ်ရောက်အံ့။"),
            (7, "ကျွဲ၊ နွား၊ ဝက်၊ ဆင်၊ မြင်းတို့အား ကောင်းသော အခြင်းအရာဖြင့်မြင်မက်မူ နတ်စိမ်းတို့ နှစ်သက်အံ့။"),
            (8, "ကျွဲခတ်သည်ဟု မြင်မက်မူ ရန်ကြီးစွာ တွေ့ရအံ့"),
            (9, "ကျွဲထွက်ပြေးသည်ဟု မြင်မက်မူ ရန်သူ၊ ကျွန်အမှုလုပ်တို့ ပြေးအံ့"),
            (10, "ကျင်ကြီးစွန့်သည်ဟု မြင်မက်မူ ဥစ္စာလျှောအံ့"),
            (11, "ကျင်ငယ်စွန့်ရသည်ဟု မြင်မက်မူ ဂုဏ်သရေလျှောအံ့"),
            (12, "ကိုယ်ပေါ်သို့ လောက်တက်သည်ဟု မြင်မက်မူ ဥစ္စာရအံ့ကျေးကျွန်၊ ကျွဲ၊ နွားသော် ရအံ့။"),
            (13, "ကိုယ်ခန္ဓာပုပ်သည်ဟု မြင်မက်မူ တန်ခိုးကြီးအံ့"),
            (14, "ကိုယ်မှာ အကြောင်အကြားရှိသည်ဟု မြင်မက်မူ မယားကောင်းရအံ့။ ကိုယ်အမွေးရှည်သည်ကို မက်မူ လာဘ်ကြီးရအံ့။ကိုယ်ရောင် တောက်ပသည်ဟု မြင်မက်မူ တန်ခိုးကြီးအံ့။"),
            (15, "ကောင်းသော အခြင်းအရာဖြင့် မြွေကို မြင်မက်မူ ပြိတ္တာ၊ သရဲ၊သဘက်တို့ ကျေးဇူးပြုအံ့။ ကောင်းသော အခြင်းအရာဖြင့် လင်းတကို မြင်မက်မူ ဇော်ဂနီနတ်ချစ်ရအံ့။"),
            (16, "ကောင်းကင်၌တည်ရှိသော ပြာသာဒ်တို့တက်၍ ကာမဂုဏ် ခံစားရသည်ဟု မြင်မက်မူ အကြီးအမှူးဖြစ်ရအံ့။"),
            (17, "ကောင်းကင်ပျံတက် တံခွန်လွှားမြင်မက်မူ ထင်ရှားရအံ့"),
            (18, "ကျောက်ဖျာအိမ်မိုးမြင်မက်မူ အများသခင်ဖြစ်ရအံ့"),
            (19, "ကျောက်ဖျာထက်နေရသည်ဟု မြင်မက်မူ အလွန်ကောင်းအံ့"),
            (20, "ကျောက်ဖျာကို မျိုရသည်ဟု မြင်မက်မူ ကျေးဇူးသတင်းပျံ့နှံ့ခြင်းဖြစ်အံ့။"),
            (21, "ကြက်ချင်းခွပ်သည်ဟု မြင်မက်မူ တရားတွေ့ရအံ့"),
            (22, "ကြက်၊ ငှက်တို့၏အတောင်များကို စားရသည်ဟု မြင်မက်မူချမ်းသာရအံ့။"),
            (23, "ကခုန်မြူးတူးရသည်ဟု မြင်မက်မူ မကောင်း"),
            (24, "ကျားစွယ်၊ မိကျောင်းစွယ်ကို ရင်ခွင်ပိုက်ရသည်ဟုမြင်မက်မူအများတက် ထူးချွန်သူ ဖြစ်ရ၏။"),
            (25, "ကျားကို မြင်မက်မူ မကောင်း"),
            (26, "ကုန်းကိုတက်ပြီးမှ ကျင်းသို့ဆင်း၍ ခေါင်းဆေးရသည်ဟု မြင်မက်မူ ဘုန်တန်းခိုးကြီးအံ့။"),
            (27, "ကြွယ်ဝသောသူကို မြင်မက်မူ ကောင်းကျိုးရောက်အံ့"),
            (28, "ကျက်ပြီးသား လူသားကိုလည်းကောင်း၊ လူ၏လက်ရုံးသားကိုလည်းကောင်း စားရသည်ဟု မြင်မက်မူ ထီပေါက်အံ့။"),
            (29, "ကွန်းစင်အခေါင် တက်ရသည်ဟု မြင်မက်မူ အကြီးအကဲ ဖြစ်အံ့"),
            (30, "ကွမ်းရွက်၊ သစ်ရွက် စားရသည်ဟု မြင်မက်မူ ပုဆိုးကောင်း၊အဝတ်ကောင်းရအံ့။"),
        ]

    let blogDetailData_2: [(Int, String)] = [
           (1, "ခရုသင်းကို မြင်မက်မူ ဘေးဥပါဒ်ပျောက်ကင်းအံ့"),
           (2, "ခရုသင်းပေးလာသည်ကို မြင်မက်မူ အကျင့်မြတ်သူ သန္ဓေတည်အံ့ခရုသင်းမှုတ်ရသည်ဟု မြင်မက်မူ စည်းစိမ်တိုးအံ့"),
           (3, "ခွေးကိုက်သည်ဟု မြင်မက်မူ အမှောင့်ပယောဂ ကိုယ်သို့ကပ်အံ့"),
           (4, "ခေါင်းဖြီးသည်ဟုမြင်မက်မူ မိဘတို့အကျော်အစောရှိအံ့ပျောက်အံ့"),
           (5, "ခံတွင်းသို့ မကောင်းသောအနံ့ဝင်သည်ဟု မြင်မက်မူ သီချင်းကျက်မှတ်ရအံ့"),
           (6, "ခံတွင်းက အနံ့မကောင်းထွက်သည်ဟု မြင်မက်မူယုတ်မာသော စကားကို ဆိုရအံ့"),
           (7, "ခံတွင်းက ကောင်းသောအနံ့ ထွက်သည်ဟု မြင်မက်မူ ကောင်းသော စကားကို ဆိုရအံ့"),
           (8, "ခံတွင်းသို့ မွှေးကြိုင်သော ရနံ့ ဝင်သည်ဟု မြင်မက်မူ လောကုတ္တရာကျမ်းစာကျက်မှတ်ရအံ့"),
           (9, "ခံတွင်းက အပုပ်နံ့ထွက်သည်ဟု မြင်မက်မူယုတ်မာသော စကားကို ဆိုရအံ့"),
           (10, "ခံတွင်းဖြင့် လက်နက်ကို ယူရသည် မြင်မက်မူ ချမ်းသာကြွယ်ဝအံ့"),
           (11, "ခံတွင်းသို့ မွှေးကြိုင်သော ရနံ့ ဝင်သည်ဟု မြင်မက်မူ လူမှောင့်လူတို့အသံထွက်သည်ဟု မြင်မက်မူ အကြံကရည်ရာမိသည်စကားကို ဆိုရအံ့"),
           (12, "ခံတွင်းသို့ နွေဦးမြင့်သော ရနံ့ ဝင်သည်ဟု မြင်မက်မူ ကျန်းမာသော စကားကို ဆိုရအံ့"),
           (13, "ခြေလက်တိုသည်ဟု မြင်မက်မူ ဘုန်းကြီးအံ့"),
           (14, "ခြေသည်းလက်သည်းတို့ကို လှီးရသည်ဟု မြင်မက်မူ အကြီးအကဲဖြစ်အံ့။ အထက်လူကြီးများ ချစ်ခင်အံ့"),
           (15, "ခြေသည်းလက်သည်းတို့ကို ရေတွက်ရသည်ဟု မြင်မက်မူအသက်ရှည်အံ့။"),
           (16, "ခြင်္သေ့ကို စီးသွားသည် မြင်မက်မူ စီးသူ ကြီးပွားချမ်းသာအံ့ခင်ပုပ်ငှက်သံကို ကြားရသည်မြင်မက်မူ အနာဖျားသင့်အံ့"),
           (17, "ခရီးသွားရသည်ဟု မြင်မက်မူ အကြံမြောက်အံ့"),
           (18, "ခိုးသူတို့ အရပ်လေးမျက်နှာမှ လာသည်ကို ဖမ်းမိသည်ဟုမြင်မက်မူ ချမ်းသာအံ့။"),
           (19, "ချွေးထွက်၊ သွေးထွက်သည်ကို မြင်မက်မူ ဘုနုးကြီးအံ့"),
           (20, "ချွန်းတောင်းလက်ဆွဲရသည်ဟု မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
           (21, "ချောင်းအကြည်၊ ကန်အကြည်ကို မြင်မက်မူ ဝန်ထမ်းဖြစ်အံ့"),
           (22, "ချိုးသား၊ ကြက်သားကို စားရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
           (23, "ခုံညင်းကစားရသည်ဟု မြင်မက်မူ အကြီးအကဲ ဖြစ်အံ့"),
           (24, "ခြူ၊ ဆည်းလည်းလှုပ်သည်ဟု မြင်မက်မူ မကောင်း"),
           (25, "ခင်ပုပ်ငှက်မြည်သံကို ကြားရသည် မြင်မက်မူ အနာကြီးသင့်ရာ၏"),
       ]
    
    let blogDetailData_3: [(Int, String)] = [
           (1, "ဂူလိုဏ်ကိုလည်းကောင်း၊ တံတိုင်းကိုလည်းကောင်း ပြုလုပ်ရသည်မြင်မက်မူ ချမ်းသာသုခကိုရ၍ ဘေးရန်မရှိတည်မြဲအံ့"),
           (2, "ဂူ(သင်္ချိုင်း)ကို မြင်မက်မူ အမွေရအံ့၊ ထီပေါက်အံ့"),
           (3, "ဂျုံစားရသည်ကို မြင်မက်မူ လုံခြုံအံ့၊ အသက်ရှည်အံ့ဝင်ငွေတိုးအံ့၊ စိတ်ချမ်းသာအံ့"),
           (4, "ဂမုန်းပင်ကို မြင်မက်မူ အကြီးအကျယ်စီးပွားဖြစ်အံ့မီးကွင်းဂမုန်းဖြစ်လျှင် ပူပင်သောက ကင်းဝေးအံ့"),
           (5, "ဂုန်လျှော်ပင်များ စိုက်ရသည်ဟု မြင်မက်မူ သာယာသောအိမ်ထောင်ရေး ဖန်တီးရအံ့"),
           (6, "ဂေါ်မုတ်ကျောက်ကို မြင်မက်မူ အေးချမ်းသာယာအံ့"),
       ]
    
    let blogDetailData_4: [(Int, String)] = [
(1, "ငှက်ပျောပင်ကို မြင်မက်မူ ရွာအရပ်ပြောင်းရအံ့"),
(2, "ငှက်ပျောပင်ကို စိုက်ရသည်ဟု မြင်မက်မူ ရာထူးကြီးရအံ့"),
(3, "ငှက်တော်ကို ဖမ်းမိသည်ဟု မြင်မက်မူ ပညာရှိဖြစ်အံ့"),
(4, "ငရုတ်သီးကို စားရသည်ဟု မြင်မက်မူ ရာထူးတိုးတက်အံ့"),
(5, "ငရုတ်၊ ချင်းစားရသည်ကို မြင်မက်မူ သူတကာတို့၏ ဆရာဖြစ်အံ့"),
(6, "ငိုကြွေးရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),

]

   
    
    let blogDetailData_5: [(Int, String)] = [
      
        (1, "စင်ကြယ်သောနွားကို မြင်မက်မူ ကောင်းကျိုးဖြစ်အံ့"),
        (2, "စောင်းတီးရသည်ဟု မြင်မက်မူ စည်းစိမ်တိုးအံ့"),
        (3, "စောင်းမှတပါး အခြားတူရိယာတို့ကို တီးရသည်၊ သီချင်းဆိုရသည်ဟု မြင်မက်မူ မကောင်း။"),
        (4, "စပါးကိုမြင်မက်မူ စကားဟောင်း ပေါ်အံ့"),
        (5, "စစ်သည်အများ လာသည်ကို မြင်မက်မူ အနာရောဂါဖြစ်အံ့စစ်ဗိုလ်ပါကို မြင်မက်မူ ချမ်းသာသုခတိုးအံ့။"),
        (6, "စည်၊ ကြေးနန်း၊ မောင်း၊ ခွက်ခွင်း၊ ပက်သာ၊ နရည်၊ ခေါင်းလောင်းစသော အသံကို ကြားရသည်ဟု မြင်မက်မူ ဘုန်းကျက်သရေတိုးအံ့။"),
        (7, "စားကြူးရသည်ဟု မြင်မက်မူ ဥစ္စာရွှေငွေလျော့အံ့၊ ဖျားနာအံ့၊ စိုးရိမ်ကြောင့်ကြမြင်မက်မူ ဆိုလေရာကောင်းအံ့။"),
        // Continue adding more strings as needed
    ]
    
    let blogDetailData_6: [(Int, String)] = [
        (1, "ဆင်၊ မြင်း၊ ဗိုလ်ပါကို မြင်မက်မူ စိတ်ချမ်းသာအံ့"),
        (2, "ဆင်ပေါက် မြင်မက်မူ သူတစ်ပါးကိုးကွယ်ရာ ဖြစ်အံ့"),
        (3, "ဆင်၊ မြင်း၊ နွားတို့ကို မြင်မက်မူ ကောင်းစားအံ့"),
        (4, "ဆင်ဖြူချွန်းတင် မြင်မက်မူ သူကောင်းပြုခံရအံ့"),
        (5, "ဆင်စွယ်နှစ်ချောင်းဆွဲရသည်ကို မြင်မက်မူ ထင်ရှားကျော်စောအံ့"),
        (6, "ဆင်ဖြူစီး၍ကောင်းကင်သို့တက်ရာ နေလနှစ်ပါးကျလာ၍ ခြေဖဝါးအပြင်ကပ်လျက်တည်သည်ဟု မြင်မက်မူ တန်ခိုးကြီးအံ့။"),
        (7, "ဆံပင်ရှည်ကို မြင်မက်မူ တန်ခိုးကြီးအံ့"),
        (8, "ဆံပင်ရှည်ကိုမြင်မက်မူ အကျင့်ကောင်း၍ အကြီးအကဲ ဖြစ်အံ့"),
        (9, "ဆံပင်ဖြေရသည်ကို မြင်မကမူ မကောင်း"),
        (10, "ဆား၊ ဆီ၌ထိုင်ရသည်ကို မြင်မက်မူ သူတစ်ပါးတို့ကိုးကွယ်ရာ ဖြစ်အံ့"),
        (11, "ဆားလျက်ရသည်ဟု မြင်မက်မူ သူတစ်ပါးတို့ ကိုးကွယ်ရာ ဖြစ်အံ့"),
        (12, "ဆင်းတုရုပ်ပွား တရားဟောသည်ကို ကြားရမက်မူ ကျော်စောအံ့|ဆိတ်ဆိတ်နေသည်ကို မြင်မက်မူ သေအံ့"),
        (13, "ဆူးစူးသည်ဟု မြင်မက်မူ ရန်တွေ့အံ့"),
        // Continue adding more strings as needed
    ]
    
    let blogDetailData_7: [(Int, String)] = [
        (1, "ဇာထိုးရသည်ကို မြင်မက်မူ အချစ်တိုးအံ့၊ အကြံအောင်အံ့"),
        (2, "ဇာကနာနှင့် အသုံးပြုသည် မြင်မက်မူ အဆွေခင်ပွန်းကောင်းရအံ့"),
        (3, "ဇာတာလုပ်ရသည်ကို မက်မူ မိမိအတွက် အထူးအကျိုးပေးအံ့"),
        (4, "ဇီးကွက်ကို နေ့အခါမြင်မက်မူ လာဘ်ကြီးရအံ့၊ ပျော်ရွှင်ရအံ့"),
        (5, "ဇီးကွက်အော်သံကြားရသည် မြင်မက်မူ အတင်းပြောသူတို့တိတ်ဆိတ်အံ့၊ ကောင်းမွန်သော နည်းလမ်းများရအံ့၊ အလုပ်အကိုင်ကြံပေးသူများပေါအံ့"),
        (6, "ဇရပ်ဆောက်လုပ်ရသည်မြင်မက်မူ ရပ်ရေးရွားရေးကိစ္စများ၌အထူးကူညီရအံ့၊ ငွေရလွယ်အံ့။"),
        (7, "ဇော်ဂျီကို မြင်မက်မူ ကျန်းမာအံ့၊ ဆေးကောင်းတွေ့အံ့၊ထင်ပေါ်ကျော်စောအံ့"),
        (8, "ဇော်က က ရသည်ကို မက်မူ အချစ်ရေး စိတ်ကူး အောင်မြင်အံ့"),
        (9, "ဇွဲ၊ ဝီရိယစိုက်၍ အလုပ်လုပ်ရသည်မြင်မက်မူ မနာလိုသူတို့တီးတိုးစကားပြောအံ့၊ အလုပ်ကောင်းအံ့")
        // Add more tuples as needed
    ]
    
    let blogDetailData_8: [(Int, String)] = [
        (1, "ဈေးဆိုင်များစွာ မြင်မက်မူ အမြတ်အစွန်းများရအံ့"),
        (2, "ဈေးဝယ်နေသည် မြင်မက်မူ ကံကောင်းအံ့"),
        (3, "ဈေးသည် မိမိအိမ်သို့ ခေါ်သည် မြင်မက်မူ ဝင်ငွေတိုးကာလာဘ်ကောင်းအံ့၊ စိတ်ပျော်ရွှင်ရအံ့။"),
        (4, "ဈာန်ရသည် မြင်မက်မူ အရောင်းအဝယ်ကောင်းအံ့"),
        (5, "ဈာန်ပျံရသည့်လူများကို မြင်မက်မူအကြီးအကဲဖြစ်အံ့၊ အောင်မြင်အံ့"),
        (6, "ဈာန်ရသော ဘုန်းတော်ကြီးကို မြင်မက်မူ အထူကဲကောင်းအံ့၊ မျက်နှာပွင့်အံ့။"),
        (7, "ဈာန်ပျံရထားစီးရသည်မြင်မက်မူ အကြီးအကဲဖြစ်အံ့၊ ထင်ပေါ်ကျော်စောအံ့။")
        // Add more tuples as needed
    ]
    
    let blogDetailData_9: [(Int, String)] = [
        (1, "ညမှောင်ပြီး အလင်းရောင်ပေါ်သည် မြင်မက်မူ ကံကောင်းချိန်ရောက်ပြီဟု မှတ်ယူပါ။"),
        (2, "ညစာစားရသည်ကို မြင်မက်မူ အိမ်တွင်းရေး အေးအံ့၊ ချစ်သူ ခင်သူပေါများအံ့"),
        (3, "ညဉ့်ငှက်သံ သာယာစွာ ကြားရသည် မက်မူ ချမ်းသာ သုခ ဖြစ်အံ့၊ မိမိလိုအင်အန္ဒပြည့်အံ့။"),
        (4, "ညီညာစွာ စွမ်းဆောင်ရသည်မြင်မက်မူ အထင်ကြီးခြင်းခံရအံ့၊ ပူဇော်ခံရအံ့။"),
        (5, "ညီအစ်ကို မောင်နှမများကို မြင်မက်မူ ကျန်းမာအံ့၊ ရောဂါအနာကင်းအံ့။"),
        (6, "ညောင်ရေအိုး မြင်မက်မူ မုချလက်ထက်ရအံ့၊ ပျားရည်ဆမ်းချစ်ခရီးထွက်ရအံ့။"),
        (7, "ညောင်ပင်ကို မြင်မက်မူ အသက်ရှည်အံ့၊ ဥစ္စာ ပစ္စည်း တိုးတက်အံ့"),
        (8, "ညောင်ရွက်ကို မြင်မက်မူ သူတော်ကောင်းများက စောင့်ရှောက်အံ့၊ အလွန်ကံကောင်းအံ့။"),
        (9, "ညောင်ရွက်အိမ် ဦးခန်းကျသည်ကို မြင်မက်မူ ရွှေဆင်းတုတော်ရရှိအံ့၊ ဘုရားကိုးဆူပင့်ရအံ့။"),
        (10, "ညည်းညူသံကြားရသည် မြင်မက်မူ ချီးမွမ်းခံရအံ့၊ ရန်သူများဒုက္ခရောက်အံ့။")
        // Add more tuples as needed
    ]
    
    let blogDetailData_10: [(Int, String)] = [
        (1, "တောင်ပို့တက် ခေါင်းဖြီးရသည်ဟု မြင်မက်မူ သူတစ်ပါးတို့၏ကိုးကွယ်ရာဖြစ်အံ့။"),
        (2, "တောင်ထိပ်၌နေရသည်ဟု မြင်မက်မူ ပြည်သူ့ဝန်ထမ်းအကြီးအကဲဖြစ်အံ့။"),
        (3, "တောင်အရပ်သို့ သွားရသည်ဟု မြင်မက်မူ ရောဂါရအံ့"),
        (4, "တောင်ကလပ်တက်နေသည်ဟု မြင်မက်မူ လက်ရှိ ရာထူးထက်မြင့်သောအဆင့်ကို ရအံ့။"),
        (5, "တောင်ဖျားတက်ရသည်ဟု မြင်မက်မူ လာဘ်ကြီးရအံ့"),
        (6, "တံခွန်လှူရသည်ဟု မြင်မက်မူ ထင်ရှားအံ့"),
        (7, "တံခွန်လွှားရသည်ဟု မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
        (8, "တံတားပေါ်လျှောက်ရသည်ဟူမြင်မက်မူ သောကရှိလျက်အလိုပြည့်အံ့။"),
        (9, "တန်ဆာဆင်ရသည်ဟု မြင်မက်မူ သူတစ်ပါး ရှိခိုးခံရအံ့"),
        (10, "တန်ဆောင်းညှိဟု မြင်မက်မူ စာတတ်အံ့၊ ထင်ရှားအံ့"),
        (11, "တူရိယာအမျိုးမျိုးတွင် စောင်းမှတစ်ပါး အခြားတူရိယာတို့ကိုတီးရသည်ဟု မြင်မက်မူ မကောင်း။"),
        (12, "တလားမှာ ဝင်သည်ကို မြင်မက်မူ သေအံ့")
    ]
    
    let blogDetailData_11: [(Int, String)] = [
        (1, "ထောပတ်၊ ပျားရည်တို့ကို နှစ်နှစ်သက်သက် မြင်မက်မူ ချမ်းသာအံ့"),
        (2, "ထောပတ်၊ နို့ စသည်တို့ကို ရွံရှာဖွယ်မြင်မက်မူ ဘီလူးဘေး၊ငတ်မွတ်ဘေး၊ နာဖျားသောဘေး တွေ့အံ့။"),
        (3, "ထမ်းစင် သံလျှင်စီးရသည် မြင်မက်မူ လာဘ်ရအံ့"),
        (4, "ထမ်းစင်ထက် ကျီးနားသည်ဟု မြင်မက်မူ နာဖျား ပျက်စီးအံ့"),
        (5, "ထမင်းစားရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
        (6, "ထမင်းနှင့်တကွ သပိတ်လွယ်ရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
        (7, "ထီးဆောင်းရသည်ဟု မြင်မက်မူ စိတ်အေးမြအံ့"),
        (8, "ထိတ်လန့်သည်ဟု မြင်မက်မူ မကောင်း"),
        (9, "ထင်းပုံပြိုကျသည်ဟု မြင်မက်မူ မကောင်း")
        // Add more tuples as needed
    ]
    
    let blogDetailData_12: [(Int, String)] = [
        (1, "ဒွန်းစဏ္ဍားအထက်က နေရသည်ဟု မြင်မက်မူ မကောင်း"),
        (2, "ဒါနပြုရသည်ဟု မြင်မကမူ ရာထူးတိုးအံ့၊ စန်းပွင့်အံ့၊ စကားကောင်းပြောအံ့။"),
        (3, "ဒုံးလှေကို မြင်မက်မူ စိတ်ပျော်ရွှင်အံ့"),
        (4, "ဒေလီယာပန်းပွင့်ကြီးကို မြင်မက်မူ အခြွေအရံ အသင်းအပင်းများပေါများအံ့။"),
        (5, "ဒေလီယာပန်းကြီး ပန်ရသည်ဟု မြင်မက်မူ မုချလက်ထပ်ရအံ့စိတ်လွတ်ကိုယ်လွတ် ပျော်ရအံ့။"),
        (6, "ဒန်အိုး၊ ဒန်ခွက်များကို မြင်မက်မူ အိမ်တွင်းသုခ ရအံ့"),
        (7, "ဒယ်အိုးကို မြင်မက်မူ စိတ်ချမ်းသာရအံ့"),
        (8, "ဒေါင်းမွေးမြူရသည်ဟု မြင်မက်မူ အိမ်ကျက်သရေတိုးအံ့"),
        
        // Add more data here as needed
    ]
    
    let blogDetailData_13: [(Int, String)] = [
        (1, "ဓာတ်တော်ရသည်ဟု မြင်မက်မူ ကျက်သရေတက်အံ့"),
        (2, "ဓာတ်လုံးနှင့် ပေါက်ရသည်၊ ပစ်ရသည်ဟု မြင်မက်မူရန်သူအပေါင်းကို အလွယ်တကူ နိုင်အံ့။"),
        (3, "ဓားသွေးကျောက်ကို မြင်မက်မူ အကြံအစည်များရှိနေအံ့"),
        (4, "ဓား၊ လှံအရောင်တောက်သည်ဟု မက်မူ ဘုန်းတန်းခိုးကြီးအံ့"),
        (5, "ဓား၊ လှံ စွဲကိုင်ရသည်ဟု မြင်မက်မူ အသက်ရှည်အံ့"),
        (6, "ဓား၊ လှံ အရောင်တောက်သည်ကို မြင်မက်မူ ဘုန်းတန်ခိုး ကြီးအံ့"),
        (7, "ဓား၊ လှံ ကိုင်ရသည် မြင်မက်မူ အသက်ရှည်အံ့"),
        (8, "ဓူဝံကြယ်ကို မြင်မက်မူ အကြံအောင်အံ့")
        // Add more tuples as needed
    ]
    
    let blogDetailData_14: [(Int, String)] = [
        (1, "နတ်ကိုလည်းကောင်း၊ ပုဏ္ဏားကိုလည်းကောင်း၊ မြင်မက်မူ ချမ်းသာသုခကြီးအံ့။"),
        (2, "နို့အမျိုးမျိုးကို သောက်သည်ဟု မြင်မက်မူ သူတစ်ပါး ပညာပေးအံ့"),
        (3, "နို့ညှစ်ရသည်ဟု မြင်မက်မူ ကြွယ်ဝအံ့"),
        (4, "နို့ကို ရွှေခွက်နှင့် ထည့်၍ သောက်ရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့နွားနို့သောက်ရသည်ဟုမြင်မက်မူ သူတစ်ပါးတို့ထက် ကျော်စောအံ့။"),
        (5, "နို့အမျိုးမျိုးကို သောက်သည်ဟု မြင်မက်မူ ကြွယ်ဝအံ့"),
        (6, "နို့အမျိုးမျိုးကို သောက်သည်ဟု မြင်မက်မူ စိတ်ချမ်းသာအံ့"),
        (7, "နို့ကို ရွှေခွက်နှင့် ထည့်၍ သောက်ရသည်ဟု မြင်မက်မူ ကောင်းစားအံ့။"),
        (8, "နတ်ရုပ်၊ ဗိဿနိုးရုပ်ကို မြင်မက်မူ အဆွေခင်ပွန်းကောင်းရအံ့"),
        (9, "နတ်ဆေးလိမ်းကျံမြင်မက်မူ ဥစ္စာရအံ့"),
        (10, "နတ်တို့ စကားပြောသည်ဟု မြင်မက်မူ တုန်လှုပ်ပျက်စီးအံ့"),
        (11, "နေဗိမာန်သည် ကြယ်အပေါင်းခြံရံချက် မြေမှကောင်းကင်သို့ ပျံတက်သည်ဟုမြင်မက်မူ ဘုန်းကံသေးငယ်သူတို့အတုမရှိ ဘုန်းကြီးအံ့။"),
        (12, "နေ လ ကြတ်သည်ဟု မြင်မက်မူ ဘုန်းကျက်သရေ တိုးအံ့"),
        (13, "နေ လတို့ မွန်းတည့်သည်ဟု မြင်မက်မူ ကြီးစွာသောချမ်းသာသုခကို ရအံ့။ အမျိုး(၇)ဆက်တိုင် မပျက်နိုင်သောစည်းစိမ်ကို ရအံ့။"),
        (14, "နေ လတို့ကို ရင်ခွင်ပိုက်ရသည်ဟု မြင်မက်မူ ရန်ပျောက်အံ့။ နေအိမ်၊ လအိမ်ဖွဲ့၍ ဝမ်းတွင်းဝင်သည်ဟု မြင်မက်မူကောင်းစားအံ့။"),
        (15, "နေ လကြယ်တို့ကို မြင်ရသည်ဟု မြင်မက်မူ သူတစ်ပါးတို့ထက်မြင့်မားသော ရာထူးရှိသူ ဖြစ်အံ့။"),
        (16, "နေသည် အရှေ့က ထွက်၍ အနောက်သို့ ဝင်သည်ဟု မြင်မက်မူကမ္ဘာတွင် ထင်ရှားသော ပုဂ္ဂိုလ်ပေါ်ပေါက်အံ့။"),
        (17, "နေ လတို့ကို ဖက်ရသည်ဟု မြင်မက်မူ ကြွယ်ဝချမ်းသာအံ့"),
        (18, "နှားတွင်းသို့ မစင်ရည်ဝင်သည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
        (19, "နှားရသည်ဟု မြင်မက်မူ ပစ္စည်းဥစ္စာတိုးအံ့"),
        (20, "နှားစီးရသည်ဟု မြင်မက်မူ ချမ်းသာအံ့"),
        (21, "နွားကျောင်းရသည်ဟု မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
        (22, "နွားချေးရေချိုးရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
        (23, "နတ်ရုပ်၊ ဗိဿနိုးရုပ်ကို မြင်မက်မူ အဆွေခင်ပွန်းကောင်းရအံ့"),
        (24, "နတ်ဆေးလိမ်းကျံမြင်မက်မူ ဥစ္စာရအံ့"),
        (25, "နတ်တို့ စကားပြောသည်ဟု မြင်မက်မူ တုန်လှုပ်ပျက်စီးအံ့"),
        (26, "နေဗိမာန်သည် ကြယ်အပေါင်းခြံရံချက် မြေမှကောင်းကင်သို့ ပျံတက်သည်ဟုမြင်မက်မူ ဘုန်းကံသေးငယ်သူတို့အတုမရှိ ဘုန်းကြီးအံ့။"),
        (27, "နေ လ ကြတ်သည်ဟု မြင်မက်မူ ဘုန်းကျက်သရေ တိုးအံ့"),
        (28, "နေ လတို့ မွန်းတည့်သည်ဟု မြင်မက်မူ ကြီးစွာသောချမ်းသာသုခကို ရအံ့။ အမျိုး(၇)ဆက်တိုင် မပျက်နိုင်သောစည်းစိမ်ကို ရအံ့။"),
        (29, "နေ လတို့ကို ရင်ခွင်ပိုက်ရသည်ဟု မြင်မက်မူ ရန်ပျောက်အံ့။ နေအိမ်၊ လအိမ်ဖွဲ့၍ ဝမ်းတွင်းဝင်သည်ဟု မြင်မက်မူကောင်းစားအံ့။"),
        (30, "နေ လကြယ်တို့ကို မြင်ရသည်ဟု မြင်မက်မူ သူတစ်ပါးတို့ထက်မြင့်မားသော ရာထူးရှိသူ ဖြစ်အံ့"),
        (31, "နေသည် အရှေ့က ထွက်၍ အနောက်သို့ ဝင်သည်ဟု မြင်မက်မူကမ္ဘာတွင် ထင်ရှားသော ပုဂ္ဂိုလ်ပေါ်ပေါက်အံ့"),
        (32, "နေ လတို့ကို ဖက်ရသည်ဟု မြင်မက်မူ ကြွယ်ဝချမ်းသာအံ့"),
        (33, "နွားကျောင်းရသည်ဟု မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
        (34, "နွားချေးရေချိုးရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
        (35, "နတ်ရုပ်၊ ဗိဿနိုးရုပ်ကို မြင်မက်မူ အဆွေခင်ပွန်းကောင်းရအံ့"),
        (36, "နတ်ဆေးလိမ်းကျံမြင်မက်မူ ဥစ္စာရအံ့"),
        (37, "နတ်တို့ စကားပြောသည်ဟု မြင်မက်မူ တုန်လှုပ်ပျက်စီးအံ့"),
        (38, "နေဗိမာန်သည် ကြယ်အပေါင်းခြံရံချက် မြေမှကောင်းကင်သို့ ပျံတက်သည်ဟုမြင်မက်မူ ဘုန်းကံသေးငယ်သူတို့အတုမရှိ ဘုန်းကြီးအံ့။"),
        (39, "နေ လ ကြတ်သည်ဟု မြင်မက်မူ ဘုန်းကျက်သရေ တိုးအံ့"),
        (40, "နေ လတို့ မွန်းတည့်သည်ဟု မြင်မက်မူ ကြီးစွာသောချမ်းသာသုခကို ရအံ့။ အမျိုး(၇)ဆက်တိုင် မပျက်နိုင်သောစည်းစိမ်ကို ရအံ့။"),
        (41, "နေ လတို့ကို ရင်ခွင်ပိုက်ရသည်ဟု မြင်မက်မူ ရန်ပျောက်အံ့။ နေအိမ်၊ လအိမ်ဖွဲ့၍ ဝမ်းတွင်းဝင်သည်ဟု မြင်မက်မူကောင်းစားအံ့။"),
        (42, "နေ လကြယ်တို့ကို မြင်ရသည်ဟု မြင်မက်မူ သူတစ်ပါးတို့ထက်မြင့်မားသော ရာထူးရှိသူ ဖြစ်အံ့"),
        (43, "နေသည် အရှေ့က ထွက်၍ အနောက်သို့ ဝင်သည်ဟု မြင်မက်မူကမ္ဘာတွင် ထင်ရှားသော ပုဂ္ဂိုလ်ပေါ်ပေါက်အံ့"),
        (44, "နေ လတို့ကို ဖက်ရသည်ဟု မြင်မက်မူ ကြွယ်ဝချမ်းသာအံ့"),
        (45, "နွားကျောင်းရသည်ဟု မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
        (46, "နွားချေးရေချိုးရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
        (47, "နတ်ရုပ်၊ ဗိဿနိုးရုပ်ကို မြင်မက်မူ အဆွေခင်ပွန်းကောင်းရအံ့"),
        (48, "နတ်ဆေးလိမ်းကျံမြင်မက်မူ ဥစ္စာရအံ့"),
        (49, "နတ်တို့ စကားပြောသည်ဟု မြင်မက်မူ တုန်လှုပ်ပျက်စီးအံ့"),
        (50, "နေဗိမာန်သည် ကြယ်အပေါင်းခြံရံချက် မြေမှကောင်းကင်သို့ ပျံတက်သည်ဟုမြင်မက်မူ ဘုန်းကံသေးငယ်သူတို့အတုမရှိ ဘုန်းကြီးအံ့။"),
    ]
    
    let blogDetailData_15: [(Int, String)] = [
        (1, "ပန်းအမျိုးမျိုးတွင် မိမိကြိုက်နှစ်သက်သော ပန်း၏အနံ့ကိုနမ်းရှူရသည်ဟု မြင်မက်မူ ကျက်သရေ ဂုဏ်သတင်း ပျံ့နှံ့အံ့။"),
        (2, "ပန်းစည်းမြင်မက်မူ ရာထူးရအံ့"),
        (3, "ပန်းထီးဆောင်းရသည်ဟု မြင်မက်မူ ကျော်စောအံ့"),
        (4, "ပန်းနီပန်၍ ဖန်ရည်စွန်းသောအဝတ်ကို ဝတ်ရသည်ဟု မြင်မက်မူဘေးထိတတ်အံ့။"),
        (5, "ပန်းကြာပန်ရသည်ဟု မြင်မက်မူ နာဖျားတတ်အံ့"),
        (6, "ပန်းပန်ရသည်ဟု မြင်မက်မူ ဖျားနာအံ့"),
        (7, "ပန်းဖြူ ပန်ရသည်ဟု မြင်မက်မူ အကြီးအကဲ ဖြစ်အံ့"),
        (8, "ပြာသာဒ်ထက်၌ အစားအစာကို စားရသည်ဟု မြင်မက်မူအထူးကောင်းမွန်အံ့။ ပြာသာဒ်ထက်မှနေ၍ အရသာအဖျော်ကိုသောက်ရသည်ဟု မြင်မက်မူ ချမ်းသာသုခ တစ်နေ့တခြားတိုးအံ့။"),
        (9, "ပြာသာဒ်၊ တောစိုးသစ်ပင်၊ အထိကရသစ်ပင်၊ တောင်တို့ကိုတက်စီးရသည်ဟု မြင်မက်မူ ချမ်းသာစီးပွားများအံ့။"),
        (10, "ပြာသာဒ်ကြီးကို ပြုရသည်ဟု မြင်မက်မူ ဘုန်းကြီးအံ့"),
        (11, "ပုဆိုးအသစ်၊ လုံချည်သစ်ကို မြင်မက်မူ ဘုန်းကျက်သရေ တိုးအံ့"),
        (12, "ပုဆိုးဖြူကို ဝတ်ရသည်ဟု မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
        (13, "ပုဏ္ဍားရေသွန်း၍ စကားပြောသံကြားရသည်ဟု မြင်မက်မူ ရန်သူလက်မှ လွတ်အံ့။"),
        (14, "ပုဏ္ဍားကို စွဲလန်းမက်သော် လာဘ်ရအံ့"),
        (15, "ပုခက်စီးရသည်ဟု မြင်မက်မူ ထင်ရှားကျော်စောအံ့"),
        (16, "ပုပ်စော ဆီ၊ ရေတို့ နားတွင်းသို့ ဝင်သည်ဟု မြင်မက်မူ ဒုစရိုက်နှင့်စပ်သော မနှစ်သက်ဖွယ်ကို ကြားရအံ့"),
        (17, "ပျားရည်သောက်ရသည်ဟု မြင်မက်မူ ကြံသမျှ ပြီးစီး၍လာဘ်ရအံ့"),
        (18, "ပျားတုတ်ခံရသည်ဟု မြင်မက်မူ ရန်တွေ့အံ့"),
        (19, "ပခြုပ်တွင်း၌ မီးလောင်သည်ဟု မြင်မက်မူ လက်အောက်ငယ်သားတို့ တော်လှန်အံ့။"),
        (20, "ပွဲခံရသည်ကိုလည်းကောင်း၊ ပွဲလမ်းသဘင်ကိုလည်းကောင်းမြင်မက်မူ မကောင်း"),
        (21, "ပိတုန်းတုပ်သည်ဟု မြင်မက်မူ ရန်တွေ့အံ့"),
        (22, "ပါးစပ်ပဲ့သည်ဟု မြင်မက်မူ အလိုရှိသောစကားကို မပြောနိုင်ဘဲဆွံ့အနေအံ့။"),
        (23, "ပတ္တမြားရသည်ဟု မြင်မက်မူ သားကောင်း ရအံ့"),
    ]
    
    
    let blogDetailData_16: [(Int, String)] = [
        (1, "ဖျာလှုပ်သည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
        (2, "ဖွဲမီးတငွေ့ငွေ့ကို မြင်မက်မူ အလွန်ပူအံ့"),
        (3, "ဖိနပ်စီးရသည်ဟု မြင်မက်မူ အသရေတိုးအံ့"),
        (4, "ဖယောင်းတိုင်ကို မြင်မက်မူ စိတ်ချမ်းသာအံ့"),
        (5, "ဖယောင်းတိုင် မီးလင်းနေသည် မြင်မက်မူနတ်ကောင်းနတ်မြတ်တို့ မ စအံ့။"),
        (6, "ဖရဲသီး မြင်မက်မူ သားကောင်းရအံ့"),
        (7, "ဖရဲသီးစားရသည် မြင်မက်မူ ရောဂါဝေဒနာ ကင်းရှင်းအံ့"),
        (8, "ဖောင်တိန်လက်ဆောင်ရသည် မြင်မက်မူ စာပေ၌အထူးအောင်မြင်ကျော်စောအံ့"),
        (9, "ဖောင်တိန်ကို မြင်မက်မူ စာပေ၌ ကျော်စောအံ့"),
        (10, "ဖန်ခွက်ရေအပြည့်နှင့်မြင်မက်မူ မင်္ဂလာပွဲများ ခင်းကျင်းရအံ့")
        // Add more tuples as needed
    ]
    
    let blogDetailData_17: [(Int, String)] = [
        (1, "ဗေဒါပန်းကို မြင်မက်မူ အကြံကောင်းရအံ့"),
        (2, "ဗေဒင်ဟောသည် မြင်မက်မူ လိုအပ်သော အကူအညီများ ပေးစွမ်းနိုင်သူ ပေါ်အံ့။"),
        (3, "ဗိုလ်ချုပ်ကြေးရုပ်ကို မြင်မက်မူ ရာထူးတိုးအံ့ရအံ့။"),
        (4, "ဗျောသံကြားရသည် မြင်မက်မူ ရာထူးတိုးအံ့"),
        (5, "ဗျိုင်းငှက်ကို မြင်မက်မူ ဇနီးကောင်း ရအံ့"),
        (6, "ဗြဟ္မာမင်းကို မြင်မက်မူ လာဘ်ကြီးရအံ့"),
        
        // Add more data here as needed
    ]

    let blogDetailData_18: [(Int, String)] = [
        (1, "ဘုရားရုပ်ထုတော် မိမိဦးခေါင်း၌ တည်ရှိသည်ဟု မြင်မက်မူအကြီးအကဲတို့ ချီးမြှောက်အံ့။"),
        (2, "ဘုရားရုပ်ထုတော် မိမိလက်ဝဲ၊ လက်ယာ ပခုံးတို့၌ တည်ရှိသည်ကိုမြင်မက်မူ ကြီးမြင့်သော အခြွေအရံ ပရိသတ်ရအံ့။"),
        (3, "ဘုရားရုပ်တုတော် မိမိခြေရင်း၌ တည်ရှိသည်ဟု မြင်မက်မူ ရှိပြီးအကြီးအကဲသည် ရာထူးသက်လျှော၍ မိမိသည်ပင်အကြီးအကဲဖြစ်အံ့။"),
        (4, "ဘုရားရုပ်တုတော် ကြွသွားတော်မူသည်ဟု မြင်မက်မူဘုန်းကျက်သရတေိုးအံ့။"),
        (5, "ဘုရားရုပ်ပွားတော် ဖူးတွေ့ရသည်ဟု မြင်မက်မူ တစ်နေ့တခြားကျော်စောအံ့။"),
        (6, "ဘုရားရုပ်တုတော်၊ စေတီတော်၊ ပုထိုးတော်တို့ကို မြင်မက်မူနတ်ကောင်းနတ်မြတ်တို့ ချစ်အံ့။"),
        (7, "ဘုရားရုပ်တုတော် မကောင်းသောအခြင်းအရာဖြင့်ကြွသွားသည်ကိုမြင်မက်မူ ဘုန်းကျက်သရေ ဆုတ်ယုတ်အံ့။"),
        (8, "ဘုရားရုပ်ပွား၊ စေတီ၊ ပုထိုးကို မကောင်းသော အခြင်းအရာအားဖြင့်မြင်မက်မူ နတ်ကောင်းနတ်မြတ်တို့ မချစ်ခင်သဖြင့် ဥပါဒ်ရောက်အံ့။"),
        (9, "ဘုရားရုပ်ပွား၊ ဆင်းတုတော် တရားဟောသည်ကို မြင်မက်မူကျော်စောအံ့။"),
        (10, "ဘုရားရုပ်ပွား၊ ဆင်းတုတော် တရားဟောသည်၊စကားပြောသည်ကို ကြားရသည်ဟု မြင်မက်မူ ကျော်စောအံ့။"),
        (11, "ဘုရားရှိခိုးသည်ဟု မြင်မက်မူ ချမ်းသာသုခတိုးအံ့"),
        (12, "ဘုရားရုပ်တုတော် ဖက်ရသည်ဟု မြင်မက်မူ ကျက်သရေတိုးအံ့"),
        (13, "ဘုရားဓာတ်တော်ရသည်ဟု မြင်မက်မူ ကျက်သရေတိုးအံ့"),
        (14, "ဘုရားဓာတ်တော်မြင်ရသည်ဟုမြင်မက်မူ ကျက်သရေ တိုးတက်အံ့")
        // Add more tuples as needed
    ]
    
    let blogDetailData_19: [(Int, String)] = [
     (1, "မိမိရူးသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
     (2, "မိမိအူကို ထုတ်၍ ပတ်ရသည်ဟု မြင်မက်မူ သြဇာအာဏာအရှိန်အဝါကြီးမားအံ့။"),
     (3, "မိကျောင်းဖမ်းသည် မြင်မက်မူ လာဘ်ရအံ့"),
     (4, "မိကျောင်းစီးရသည် မြင်မက်မူ ရန်သူကို နိုင်အံ့"),
     (5, "မိကျောင်းစွယ်ကို ရင်ခွင်ပိုက်သည်ဟု မြင်မက်မူ ရာထူးကြီးအံ့"),
     (6, "မိကျောင်းသား စားရသည် ဟု မြင်မက်မူ လာဘ်ကြီးအံ့"),
     (7, "မိန်းမကို ဆွဲရသည်ဟု မြင်မက်မူ ချမ်းသာကြွယ်ဝအံ့"),
     (8, "မိန်းမနှင့် အတူ အိပ်ရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
     (9, "မိန်းမကို နားထွင်းရသည်ဟု မြင်မက်မူ ရွှေရအံ့"),
     (10, "မိန်းမအမွေးအမျှင်ရှည်သည်ကို မြင်မက်မူ ချမ်းသာအံ့"),
     (11, "မျက်စိမှိတ်သည်ဟု မြင်မက်မူ အရမ်းကာရော ပြုမိအံ့"),
     (12, "မျက်စိဖွင့်သည်ဟု မြင်မက်မူ ကောင်းကျိုး၊ မကောင်းကျိုးကို မြင်ရအံ့"),
     (13, "မျက်စိကြည်လင်သည်ဟု မြင်မက်မူ အသိဉာဏ်နည်းပါးအံ့"),
     (14, "မျက်စိ၌ အမှိုက်ဝင်သည်ဟု မြင်မက်မူ အနိဠာရုံကို ရအံ့"),
     (15, "မျက်စိ၌ တိမ်သလ္လာကျသည်ဟု မြင်မက်မူ အသိဉာဏ်နည်းအံ့"),
     (16, "မျက်စိ၌ မျက်ချီးများသည်ဟု မြင်မက်မူ အရှိန်အစော်မဲ့အံ့"),
     (17, "မျက်စိပျက်သည်ဟု မက်မူ သားသမီးတို့ ထွက်ပြေးတတ်အံ့"),
     (18, "မီးပုံမှ အခိုးအလျှံထွက်သော မီးကို မြင်မက်မူ ပညာရှိ ပေါ်ထွန်းအံ့"),
     (19, "မီးထည့်ရသည်၊ မီးဖုတ်ရသည်၊ မီးရှို့ရသည်၊ မီးတိုက်ရသည်ဟုမြင်မက်မူ ရပ်ရွာကြီးကဲ ဖြစ်အံ့"),
     (20, "မီးတန်ဆောင် ညှိထွန်းရသည်ဟု မြင်မက်မူ ပညာတတ်အံ့"),
     (21, "မီးမှုတ် မက်မူ အကြီးအကဲဖြစ်အံ့"),
     (22, "မီးတငွေ့ငွေ့မြင်မက်မူ စိတ်နှလုံးပူပန်ရအံ့"),
     (23, "မြွေငန်းစီးရသည်ဟု မြင်မက်မူ ရောဂါဖြစ်အံ့"),
     (24, "မြွေကိုက်သည်ကို မြင်မက်မူ လူလိမ်ခံရအံ့"),
     (25, "မြွေကို ခါးပိုက်ပိုက်ရသည်ကို မြင်မက်မူ အတွင်းရန်ဖြစ်ပေါ်အံ့"),
     (26, "မြွေခဲသည်ကို မြင်မက်မူ သားသမီးရ၍ အစွဲရှိအံ့"),
     (27, "မြွေခံသည်ကို မြင်မက်မူ လာဘ်ရအံ့"),
     (28, "မြွေစိမ်းကိုက်သည်ကို မြင်မက်မူ လူလိမ်တွေ့ရအံ့"),
     (29, "မြွေပွေး၊ မြွေဟောက်ကိုက်လိုက်သည်ကို မြင်မက်မူ လူဆိုးတို့လိမ်ရန် လာအံ့"),
     (30, "မြေတူးရသည်ဟု မြင်မက်မူ မကောင်း"),
     (31, "မြေဇာပန်း ပန်ရသည်ဟု မြင်မက်မူ ပညာရှိ ဆရာတစ်ဆူဖြစ်အံ့"),
     (32, "မြင်းမိုရ်တောင် ခေါင်းအုံးရသည်ကို မြင်မက်မူ လူအများပူဇော်ခြင်းကို ခံရအံ့"),
     (33, "မြင်းမိုရ်တောင်သို့ တက်ရသည်ဟု မြင်မက်မူ လူချစ်လူခင်များအံ့"),
     (34, "မြင့်ရာမှ နိမ့်ကျသည်ဟု မြင်မက်မူ မကောင်း"),
     (35, "မြင့်သောအရပ်ကို တက်ရသည်ဟု မြင်မက်မူ လူတကာတို့ထက်မြင့်မြတ်ရအံ့"),
     (36, "မန်ကျည်းသီး စားရသည်ကို မြင်မက်မူ သူကောင်းဖြစ်အံ့"),
     (37, "မိုးရေထဲ ပျော်ပါးရသည်ကို မြင်မက်မူ ဥစ္စာပစ္စည်းရအံ့"),
     (38, "မစင်လိမ်းကျန်ရသည်ကို မြင်မက်မူ ပစ္စည်းဥစ္စာရအံ့"),
     (39, "မှိုချက်စားရသည်ကို မြင်မက်မူ လာဘ်ရအံ့"),
     (40, "မြစ်ရေသောက်ရသည်ကို မြင်မက်မူ သူတစ်ပါးတို့ထက်ကျော်စောထင်ရှားအံ့"),
     (41, "မုန်တိုင်းထန်သည်ကို မြင်မက်မူ ကြောင့်ကြများအံ့များအံ့"),
     (42, "မျှော့တွယ်သည်ကို မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
     (43, "မောင်းတိုဆောင်းရသည်ကို မြင်မက်မူ အကြီးအကဲ ဖြစ်အံ့"),
     (44, "မကောင်းသောရေကို သွန်းလာသည်ကို မက်မူ ပျက်စီးအံ့"),
     (45, "မကာရ်းကို ဖမ်းမက်မူ လာဘ်ရအံ့"),
 ]
     
     
    
    let blogDetailData_20: [(Int, String)] = [
        (1, "ယောက်ျားချင်းသင့်မြတ်၍ ကိုယ်ဝန်ရှိသည်ကို မြင်မက်မူမကောင်း"),
        (2, "ယမမင်းကို မြင်မက်မူ အသက်ရှည်အံ့မိမိအားစောင့်ရှောက်သူကို ကျေနပ်ဖွယ်တွေ့ရအံ့။"),
        (3, "ယိုးစွပ်ခံရသည်မြင်မက်မူ အကြံအောင်အံ့ပျက်စီးအံ့။ အနီးရန်သူများ ဘေးတွေ့ကြအံ့။"),
        // Add more data as needed
    ]
    
    
    let blogDetailData_21: [(Int, String)] = [
        (1, "ရွှေကိုဖြစ်စေ၊ ငွေကိုဖြစ်စေ မြင်မက်မူ ယောက်ျားမှာမယားကောင်းရအံ့။"),
        (2, "ရွှေရတနာ ပတ္တမြားစသော ရတနာတို့ကို မြင်မက်မူကောင်းကျိးရအံ့။"),
        (3, "ရွှေလက်ဖွဲ့ဝတ်ရသည်ဟု မြင်မက်မူ ယောက်ျား၌ မယားရအံ့"),
        (4, "ရွှေဟင်္သာ တရားဟောသည်ကို နာကြားရသည်ဟု မြင်မက်မူဘုန်းကျက်သရေတိုးအံ့၊ စိတ်ချမ်းသာအံ့။"),
        (5, "ရွှေလက်ကောက်ဝတ်မက်မူ ကြီးသောသူတို့ ချီးမြှင့်ခံရအံ့"),
        (6, "ရွှေငွေအား အစိုးရသည်ကို မြင်မက်မူ ချမ်းသာအံ့"),
        (7, "ရွှေခွက်နှင့်ထည့်၍ ထမင်းစားရသည် မြင်မက်မူ ထီပေါက်အံ့ကြီးကျယ်သော လာဘ်ရအံ့။"),
        (8, "ရေကြည်ကို မြင်မက်မူ အလွန်စိတ်ချမ်းသာအံ့"),
        (9, "ရေနောက်ကို မြင်မက်မူ အလွန်စိတ်မချမ်းသာအံ့"),
        (10, "ရေထဲ၌ မြွေ၊ ကင်းတို့ကို မြင်မက်မူ ချမ်းသာရောက်အံ့"),
        (11, "ရေကန်၏အလယ် ကြာထက်၌ နို့ဃနာ စားရသည်ကို မြင်မက်မူသူတစ်ပါးထက် ကြီးကျယ်မြင့်မြတ်သူ ဖြစ်အံ့။"),
        (12, "ရေသောက်ရသည်ဟု မြင်မက်မူ ဂုဏ်သတင်းတိုးအံ့"),
        (13, "ရေအိုးတွင် လ ကျသည်ဟု မြင်မက်မူ ဘုန်းတန်ခိုးကြီးအံ့"),
        (14, "ရဟန်းသာမဏေ၊ ရသေ့တို့၏ မကောင်းသောအခြင်းအရာမြင်မက်မူ သမ္မာဒေဝနတ်တို့ မုန်းသဖြင့် ဥပါဒ်ရောက်အံ့။"),
        (15, "ရဟန်း၊ ပုဏ္ဏားနှင့် ကြုံရ မြင်မက်မူ ချမ်းသာအံ့"),
        (16, "ရဟန်း၊ ပုဏ္ဏားနှင့် စကားပြောရ မြင်မက်မူ ချမ်းသာအံ့"),
        (17, "ရဟတ်ကို မြင်မက်မူ မကောင်း"),
        (18, "ရှောက်သီး၊ သံပုရာသီး စားရသည်ကို မက်မူ လာဘ်ရအံ့"),
        (19, "ရထားစီးရသည်ကို မြင်မက်မူ အံ့"),
        (20, "ရုပ်ထုကို ဖက်ရသည် မြင်မက်မူ ချမ်းသာကြွယ်ဝအံ့"),
        (21, "ရွှံ့စင်၊ ရွှံ့ထိမက်မူ မကောင်းသတင်း ဖြစ်အံ့"),
        (22, "ရွှံ့ နားဝင်မက်မူ ကျက်သရေ ယုတ်အံ့"),
        (23, "ရယ်စရာပြုမက်မူ ဝမ်းမြောက်စရာ ကိစ္စဖြစ်အံ့")
    ]
    
    let blogDetailData_22: [(Int, String)] = [
            (1, "လှေစီးရသည်ကို မြင်မက်မူ ချမ်းသာတိုးအံ့"),
            (2, "လှေစီးစဉ် ရေနစ်သည်ဟု မြင်မက်မူ ပစ္စည်းဥစ္စာပျက်စီးအံ့"),
            (3, "လှေစီးလျက် မြစ်ကို ပင်ပန်းစွာ ကူးရသည်ဟု မြင်မက်မူအရပ်တစ်ပါးပြောင်းပြီး ပြန်ရအံ့။"),
            (4, "လက်နက်ကို ဖက်ရသည်ဟု မြင်မက်မူ ချမ်းသာအံ့"),
            (5, "လက်ကတုံးတိုင်မ လဲသည်ကို မြင်မက်မူ မယားသေအံ့"),
            (6, "လက်ကတုံးတိုင်မ လဲသည်ကို မြင်မက်မူ မက်သူ သေအံ့"),
            (7, "လက်ကတုံးတိုင် လဲသည် မြင်မက်မူ ကိုးကွယ်ထားသောအကြီးအကဲ သေအံ့"),
            (8, "လူသေကို မြင်မက်မူ စကားဟောင်းပေါ်အံ့"),
            (9, "လူဦးခေါင်းပြတ်သည်ကို မြင်မက်မူ ရန်အောင်အံ့"),
            (10, "လူသားစားရသည်ကို မြင်မက်မူ အထွတ်အထိပ်သို့ ရောက်အံ့"),
            (11, "လူသားကို ဓားနှင့်လှီး၍ စားရသည်ကို မြင်မက်မူ လူဖြစ်လျှင်အကြီးအကဲဖြစ်အံ့။ ရဟန်းဖြစ်မူ မင်းဆရာ သာသနာပိုင်ဖြစ်အံ့"),
            (12, "လှည်း၊ ပျဉ်၊ တံစဉ်း၊ ဆုံ၊ ချားရဟတ်ကို မြင်မက်မူသူမကောင်းကြံတတ်အံ့"),
            (13,  "လှည်းဘီးကို မြင်မက်မူ အကြီးအကဲဖြစ်အံ့"),
            (14,"လက်ကောက်၊ လက်စွပ်၊ ခြေကျင်း ဝတ်ရသည်ဟု မြင်မက်မူသားကောင်းရအံ့။" ),
            (15,"လက်ကောက်၊ နားထောင်း၊ ဆံကျင် ဝတ်ရသည်ကို မြင်မက်မူရာထူးရာခံရအံ့။"),
            (16,"လက်ကောက်ဝတ်ဆင်မက်မူ သားကောင်းရအံ့"),
            (17,  "လက်ကိုလည်းကောင်း၊ ပေါင်ကိုလည်းကောင်း၊ ရင်ကိုလည်းကောင်း ကျော့ကွင်းဖွဲ့မြင်မက်မူ သားသမီးရအံ့။"),
            (18, "လူတို့၏ အူအချင်းကို စားရသည် မြင်မက်မူ ကြွယ်ဝချမ်းသာအံ့လူ၏ ဦးခေါင်းကို စားရသည်ကို မြင်မက်မူ ထင်ရှားကျော်ကြားအံ့။"),
            (19,"လက်ဝဲ အံသွားကျိုးသည်ကို မြင်မက်မူ အမျိုးမိန်းမတို့၌ဥပါဒ်ဖြစ်အံ့။" ),
            (20, "လက်စွပ်ဝတ်ရသည်ဟု မြင်မက်မူ သူစွပ်စွဲအံ့"),
            (21, "လက်ယာအံသွားကျိူးသည်ကို မြင်မက်မူ အမျိုးယောက်ျားတို့၌ဥပါဒ်ဖြစ်အံ့။"),
            (22,  "လက်ဝါးထက် ကြာပန်းရောက်သည်ကို မြင်မက်မူ ကျော်စောအံ့လွှားကစားရသည်ကို မြင်မက်မူ မကောင်း။"),
            (23,  "လည်တို၍ ဦးသျှောင်လှီးမက်မူ နာဖျားတတ်အံ့"),
            (24,   "လည်ပင်းတိုသည် မြင်မက်မူ နာဖျားတတ်အံ့"),
            (25,   "လောက်ဖမ်းရသည်ကို မြင်မက်မူ အစားအသောက် ဆန်စပါးပေါများအံ့။"),
            (26,  "လက်ယာလက်ချောင်းတို့ ကြီးသည်ကို မြင်မက်မူ အမျိုးသားတို့ကြီးပွားအံ့။"),
            (27, "လက်ဝဲလက်ချောင်းတို့ ကြီးသည်ကို မြင်မက်မူ အမျိုးသမီးတို့ကြီးပွားအံ့။"),
            (28,  "လက်ယာလက်သည်း ပုပ်သည် မြင်မက်မူ သား နာဖျားအံ့"),
            (29, "လက်ဝဲလက်သည်း ပုပ်သည် မြင်မက်မူ သမီးဖျားနာအံ့"),
            (30,  "လက်သည်းရှည်သည် မြင်မက်မူ အသက်ရှည်အံ့"),
            (31,  "လက်ဝဲခြေသည်းပုပ်သည် မြင်မက်မူ အမျိုးသမီး နာဖျားအံ့"),
            (32, "လက်ယာခြေသည်း ပုပ်သည် မြင်မက်မူ အမျိုးသား၌ နာဖျားအံ့"),
            (33, "လက်ယာခြေသည်းပွင့်သည် မြင်မက်မူ အမျိုးသား၌ လာဘ်ရအံ့လက်ဝဲခြေသည်းပွင့်သည်ကို မြင်မက်မူ အမျိုးသမီး၌ လာဘ်ရအံ့။"),
            (34,  "လက်ယာလက်သဲပွင့်သည်ကို မြင်မက်မူ သား၌ လာဘ်ရအံ့လက်ဝဲလက်သဲပွင့်သည်ကို မြင်မက်မူ သမီး၌ လာဘ်ရအံ့။"),
            (35, "လက်ယာပေါင်ကြီးသည်ကို မြင်မက်မူ ကိုယ့်အောက်နိမ့်သူအမျိုးသားတို့ ကြီးပွားအံ့။ လက်ဝဲပေါင်ကြီးသည် မြင်မက်မူကိုယ့်အောက်နိမ့်သူ အမျိုးသမီးတို့ ကြီးပွားအံ့။"),
            (36, "လက်ယာပေါင် ကြုံလှီသည်ကို မြင်မက်မူ ကိုယ့်အောက်ငယ်သူအမျိုးယောက်ျားတို့ ညှိုးနွမ်းအံ့။ လက်ဝဲပေါင် ကြုံလှီသည်ကိုမြင်မက်မူ ကိုယ့်အောက်ငယ်သူ အမျိုးသမီးတို့ ညှိုးနွမ်းအံ့။"),
            (37,   "လက်ဝဲပေါင်ပဲ့သည်ကို မြင်မက်မူ အမျိုးမိန်းမတို့ နာဖျားအံ့"),
            (38,    "လက်ယာပေါင်ပဲ့သည်ကို မြင်မက်မူ အမျိုးသားယောက်ျားတို့ဖျားနာအံ့။"),
            (39,  "လက်ယာခြေသလုံးကြီးသည် မြင်မက်မူ အမျိုးယောက်ျားတို့ကြီးပွားအံ့။"),
            (40, "လက်ဝဲခြေသလုံးကြီးသည် မြင်မက်မူ အမျိုးမိန်းမတို့ ကြီးပွားအံ့"),
            (41, "လက်ယာခြေသလုံး ကြုံလှီသည် မြင်မက်မူ အမျိုးယောက်ျားတို့နွမ်းနယ်အံ့။"),
            (42,  "လက်ဝဲခြေသလုံး ကြုံလှီသည် မြင်မက်မူ အမျိုးမိန်းမတို့နွမ်းနွယ်အံ့။"),
            (43, "လက်ယာခြေသလုံးပဲ့သည် မြင်မက်မူ အမျိုးယောက်ျားတို့နာဖျားအံ့။ လက်ဝဲခြေသလုံးပဲ့သည် မြင်မက်မူ အမျိုးမိန်းမတို့ဖျားနာအံ့။"),
            (44,  "လက်ယာလက်မောင်းကြီးသည် မြင်မက်မူ သား၊ညီတို့ကြီးပွားချမ်းသာအံ့။ မြင်မက်သူက မိန်းမဖြစ်မူ သားအကြီး၊ မောင်အကြီး"),
            (45,"လက်ဝဲလက်မောင်းကြီးသည်ဟုမြင်မက်မူ သမီး၊ နှမတို့ ကြီးပွားအံ့။" ),
            (46,     "လက်ယာလက်ရုံး ပွန်းပဲ့သည်ဟု မြင်မက်မူ နှမ၊ သားသမီးတို့နာဖျားအံ့။ မိန်းမမက်မူ သမီး၊ ညီမတို့ နာဖျားအံ့။"),
            (47, "လက်ဝဲလက်ရုံးပဲ့သည် မြင်မက်မူ နှမ၊ သားသမီးတို့ နာဖျားအံ့၊မိန်းမမက်မူ သမီး၊ ညီမတို့ နာဖျားအံ့။" ),
            (48, "လက်ယာလက်မောင်းကြုံလှီသည် မြင်မက်မူ ညီနှင့် သားတို့နာဖျားအံ့။ လက်ဝဲလက်မောင်း ကြုံလှီသည်ကို မြင်မက်မူ နှမနှင်သမီးတို့ နာဖျားအံ့။"),
            (49,   "လက်ယာလက်မောင်းသွေးယိုသည်ဟု မြင်မက်မူ ညီ၊ သားတို့တစ်ရပ်တစ်ပါးသို့ ပြောင်းရွှေ့သွားရအံ့။"),
            (50,  "လက်ဝဲလက်မောင်း သွေးယိုသည်ဟု မြင်မက်မူ ညီမ၊ သမီးတို့တစ်ပါးသို့ ပြောင်းရွှေ့သွားအံ့။"),
            (51,  "လက်ယာဘက် လက်ငါးချောင်းတွင် တစ်ချောင်းကြီးသည်မြင်မက်မူ သားနှင့်ညီတို့၏ သားသမီးများ ကြီးပွားအံ့။"),
            (52, "လက်ဝဲဘက် လက်ငါးချောင်းတွင် တစ်ချောင်းကြီးသည် မြင်မက်မူသမီးနှင့် ညီမတို့၏ သားသမီးများ ကြီးပွားအံ့။"),
            (53, "လက်ယာလက်ချောင်း ပွန်းပဲ့သည်ဟု မြင်မက်မူ သားနှင့် ညီတို့၏သားသမီးများ နာဖျားအံ့။"),
            (54, "လက်ဝဲလက်ချောင်း ပွန်းပဲ့သည်ဟု မြင်မက်မူ သမီးနှင့်ညီမတို့၏သားသမီးများ နာဖျားအံ့။"),
            (55,  "လက်ယာဘက်လက်ချောင်း ပြတ်သည်ဟု မြင်မက်မူသားနှင့်ညီတို့၏ သားသမီးများ ပျက်စီးအံ့။ လက်ဝဲလက်ချောင်းပြတ်သည်ဟုမက်မူ သမီးနှင့်ညီမတို့၏ သားသမီးများ ပျက်စီးအံ့။"),
            (56,"လက်ယာနား ကြီးသည်ဟု မြင်မက်မူ ဆွေရင်းမျိုးရင်း မိတ်ဆွေတို့ကြီးပွားအံ့။ လက်ဝဲနား ကြီးသည်ဟု မြင်မက်မူ ဆွေရင်းမျိုးရင်းမိတ်ဆွေတို့ ညှိုးနွမ်းအံ့။"),
            (57, "လဲသည်ဟု မြင်မက်မူ တရားရှုံးအံ့"),
            (58,  "လေးမျက်နှာမှလာ၍ ခိုးသူကို ဖမ်းမက်မူ ချမ်းသာအံ့"),
            (59, "လိပ်၊ ငါး စားရသည်ကို မြင်မက်မူ စပါးဆန်ရေ အစားအစာပေါကြွယ်ဝအံ့။"),
            (60, "လိပ်ဥ၊ ဖွပ်ဥမှစ၍ ဥအမျိုးမျိုးစားရသည်ကို မြင်မက်မူဆင်းရဲသော်လည်း ကြွယ်ဝချမ်းသာအံ့။"),
            (61,  "လိပ်၊ ငါး ဖမ်းရသည် မြင်မက်မူ ဆန် စပါး ရအံ့"),
            (62,  "လိင်တိုသည်ကို မြင်မက်မူ မယားအနိုင်ကျင့်ခံရအံ့"),
            (63,  "လယ်၌ ကြာရောက်သည် ကြာပေါက်သည်ကို မြင်မက်မူ အများ၏ခေါင်းဆောင်ဖြစ်အံ့။"),
            
            //so on
        ]
   
    
    let blogDetailData_23: [(Int, String)] = [
        (1, "ဝက်ပက်ခြင်းကို မြင်မက်မူ ခိုက်ရန်ဖြစ်အံ့"),
        (2, "ဝက်ပက်ခံရသည်ကို မြင်မက်မူ မကောင်း"),
        (3, "ဝက်ကို ခြံလှောင်သည်ဟု မြင်မက်မူ ကျော်စောအံ့"),
        (4, "ဝက်ရူးပြန်မက်မူ ရန်သူရောက်အံ့"),
        (5, "ဝမ်းတွင်းသို့ ငါးဝင်မည်ဆိုသော အသံကို ကြားရသည်ဟု မြင်မက်မူသားကောင်းရအံ့။"),
        (6, "ဝမ်းမြောက်ဝမ်းသာ မြင်မက်မူ ကောင်းစားအံ့"),
        (7, "ဝတ်ဖြူစင်ကြယ်ဝတ်ရ မြင်မက်မူ ချမ်းသာကြွယ်ဝအံ့"),
        (8, "ဝရမ်းဖမ်းမက်မူ လာဘ်ကြီးရအံ့")
        // Add more data if needed
    ]
    
    let blogDetailData_24: [(Int, String)] = [
   
            (1, "သွေးကို ရေချိုးရသည်ဟု မြင်မက်မူ ချမ်းသာအံ့"),
            (2,  "သွေးပေါက်ယိုစီးသည်ဟု မြင်မက်မူ ဘုန်းကြီးအံ့"),
            (3, "သွေးကိုလည်းကောင်း၊ မြေပြင်၌ လက်နက်တိုက်ကိုလည်းကောင်း၊မြူတိမ်ကင်းစော ကောင်းကင်ကိုလည်းကောင်း၊ နတ်ကိုလည်းကောင်း၊ ပုဏ္ဏားကိုလည်းကောင်း မြင်မက်မူ ချမ်းသာအံ့။"),
            (4,  "သမုဒ္ဒရာကိုရေကူးရသည်ကိုမြင်မက်မူ တိုင်းပြည်ခေါင်းဆောင်ဖြစ်အံ့"),
            (5,  "သမုဒ္ဒရာ၌ အိပ်ရာပြု၍ မိန်းမပေါင်းခြံရံလျက်ကာမဂုဏ်ခံစားရသည် ကို မြင်မက်မူ မင်းစိုးရာဇာဖြစ်အံ့။"),
            (6, "သမုဒ္ဒရာရေကို သောက်ရသည် မြင်မက်မူအလွန်ကျော်စောထင်ရှားအံ့။"),
            (7, "သားသမီးရသည် မြင်မက်မူ ချမ်းသာအံ့"),
            (8, "သားငါးစားရ၊ မိချောင်းစားရ မြင်မက်မူ လာဘ်ကြီးအံ့"),
            (9, "သစ်သီးစားရသည်၊ မြိန်သောအရသာကို စားရသည်ကို မြင်မက်မူလာဘ်ကြီးအံ့။"),
            (10,"သစ်သီးလွယ်ပိုးရသည်ဟု မြင်မက်မူ ကောင်းအံ့"),
            (11, "သူတောင်းစားကို မြင်မက်မူ စစ်သည်ဗိုလ်ပါ ဖြစ်အံ့"),
            (12, "သူကောင်းကို ချီရသည်ကို မြင်မက်မူ လာဘ်ရအံ့"),
            (13, "သူငယ်ကို ချီရသည်ကို မြင်မက်မူ လာဘ်ရအံ့"),
            (14, "သူတစ်ပါး သားမယားကို ကျူးလွန်သည်ဟု မြင်မက်မူ မကောင်း၊ဖျားနာအံ့။ သူတစ်ပါးကို စည်းတား ကန့်ကွက်ရသည်ဟု မြင်မက်မူမကောင်း။"),
            (15, "သူခိုးကို ခုတ်ဖြတ်ရသည် မြင်မက်မူ အန ္တရာယ်ပျောက်အံ့"),
            (16, "သာယာသောအသံကို ကြားရသည်ဟု မြင်မက်မူ စိတ်ချမ်းသာ၍သတင်းကောင်းကြားရအံ့။"),
            (17, "သပတ်၊ ပရိက္ခရာတို့ကို မြင်မက်မူ လာဘ်ရအံ့"),
            (18, "သေရည်သေရက် သောက်ရသည်ဟု မြင်မက်မူကြောင့်ကြများအံ့။"),
            (19, "သေသူထသည်မြင်မက်မူ စကားဟောင်းပေါ်အံ့"),
            (21,"သင်္ဘောစီးရသည် မြင်မက်မူ သူတစ်ပါးထက် မြတ်အံ့"),
            (22, "သွားနာသည်၊ နဲ့သည်၊ ယိုင်သည် မြင်မက်မူ ဥစ္စာလျှောအံ့ဖျားနာအံ့။"),
            (23, "သိန္ဓောမြင်းကို ရသည်ဟု မြင်မက်မူ အသက်ရှည်အံ့"),
        ]
    
    let blogDetailData_25: [(Int, String)] = [
            (1,  "ဟင်္သာငှက်နှင့် သူရဿတီ မယ်တော်အား မြင်မက်မူကောင်းကျိုးပေးအံ့။"),
            (2,  "ဟင်းမျိုးစုံစားရသည်မက်မူ ဝမ်းရေးအတွက် စိတ်အေးရအံ့"),
            (3, "ဟော်နန်းဆောင်ကို မြင်မက်မူ သာယာအေးချမ်းစွာနေရအံ့"),
            (4, "ဟောက်သံကြားရသည် မြင်မက်မူ စားဝတ်နေရေး အဆင်ပြေအံ့"),
            (5, "(ကျား) ဟိန်းသံ ကြားရသည် မြင်မက်မူ အကြံပေးသူ ဖြစ်အံ့"),
        ]
    
    let blogDetailData_26: [(Int, String)] = [
    
            (1,  "အိမ်ကို ဆူးရံသည်ဟု မြင်မက်မူ (သို့မဟုတ်) စည်းစောင်ရမ်းကာရံသည်ဟု မြင်မက်မူ ချမ်းသာအံ့။"),
            (2, "အိမ်စောင်း၍ သွားသည်ဟု မြင်မက်မူ ဖရိုဖရဲ အရှက်ကွဲအံ့အိမ်ပြုသွားသည်ဟု မြင်မက်မူ အိမ်ရှင်တို့ အရှက်ရ၍ အကျိုးမဲ့အံ့။"),
            (3, "အိမ်ရှိသည့်အရပ်၌ လဟာပြင်ကွင်းအထိ မြင်မက်မူ ၎င်းအရပ်၌မီးလောင်အံ့။ အိမ်၌ ထင်းပေါက်ရသည်ဟု မြင်မက်မူ မိုးကြိုးကျအံ့။"),
            (4, "အိမ်မီးလောင်သည်ဟု မြင်မက်မူ ဘေးရောက်အံ့"),
            (5, "အိမ်ပြို၊ ဘုရားပြို၊ သစ်ပင်ကျိုးသည်ကို မြင်မက်မူ ဘေးရောက်အံ့အိမ်ဝန်းကျင်၌ မှိုပေါက်သော် မိုးကြိုးကျအ့။"),
            (6,  "အိမ်ဝင်းထဲ၌ ဆင်၊ မြင်း၊ နွားသွားသည်ကို မြင်မက်မူကောင်းကျိုးရအံ့။ အိမ်ခေါင်မိုးသို့တက်၍ ရေသောက်ရသည်ဟုမြင်မက်မူ အကြီးအကဲဖြစ်အံ့။"),
            (7, "အိမ်တွင် ခရမ်းပင်စိုင်သည်ဟု မြင်မက်မူ မကောင်း"),
            (8, "အိမ်သစ်ထက်၌ စောင်းတီးသည်ဟု မြင်မက်မူ မင်းဆရာဖြစ်အံ့"),
            (9, "အိမ်ရာထောင်ရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
            (10,"အုန်းသီး၊ ထန်းသီးကို မြင်မက်မူ လာဘ်ရအံ့"),
            (11,"အုန်းသီး၊ ထန်းသီးစားရသည်ဟု မြင်မက်မူ လာဘ်ရအံ့"),
            (12, "အေးယာဉ်စီးရသည်ဟူ၍လည်းကောင်း၊ ဝက် စီးရသည်ဟူ၍လည်းကောင်း မြင်မက်မူ သေအံ့။"),
            (13,"အိုးမည်းလိမ်းကျံရသည်ဟု မြင်မက်မူ မကောင်း"),
            (14,"အိုးလည်ပြတ်သည်ကို မြင်မက်မူ မကောင်း"),
            (15,"အဝတ်မည်းကို ဝတ်သော သတို့သမီးသည် မည်းသောပန်းကိုပန်လျက် တစ်စုံတစ်ခု စွဲကိုင်သည်ကို မက်မူ သေပျောက်တတ်အံ့။"),
            (16,"အဝတ်ရွှေရောင်ဝတ်သော အမျိုးသမီးသည် ရွှေရောင်ပန်းကိုပန်လျက် တစ်စုံတစ်ခုစွဲကိုသ်သည်ကို မြင်မက်မူ ရာထူးကြီးကိုရ"),
            (17,"အဝတ်ဖြူဝတ်သော အမျိုးသမီးသည် ဖြူသော ပန်းကိုပန်လျက် တစ်စုံတစ်ရာကိုကိုင်သည်ကို မြင်မက်မူ ကြီးပွားတိုးတက်အံ့။"),
            (18,"အရူးလှည့်ပတ်ခံရသည်ဟု မြင်မက်မူ သွားလေရာ အရပ်တိုင်းလာဘ်ရအံ့။"),
            (19,"အနှိပ်စက်ခံရသည်ဟု မြင်မက်မူ သွားလေရာအရပ်တိုင်းလာဘ်ရအံ့။"),
            (21, "အစွယ်ရှိသော သတ္တဝါ၊ ဦးချိုရှိသော သတ္တဝါနှင့် မျောက်၊ဝက်တို့၏ အနှိပ်စက်ခံရသည်ဟု မြင်မက်မူ ရာဇဝတ်သင့်အံ့။"),
            (22,"အဆင်းလှသော ဦးပြည်ကတုံးမိန်းမနှင့် ကာမစပ်ယှက်သည်ဟုလည်းကောင်း၊ ထိပါးရသည်ဟုလည်းကောင်း မြင်မက်မူ ယောက်ျားမြတ်တို့၏ ဆရာခံရအံ့။"),
            (23,"အထက်ရှေ့သွားကျိုးသည်ဟု မြင်မက်မူ သား၌ ဥပါဒ်ဖြစ်အံ့"),
            (24,"အယူမှားသော သူကို မြင်မက်မူ မိစ္ဆာနတ် နှောင့်ယှက်တတ်အံ့အလိုမတူသူနှင့် ပေါင်းဖော်ရသည်ဟု မြင်မက်မူ သေတတ်အံ့။"),
            (25,"အရပ်လေးမျက်နှာ လူသူလေးပါးလာသည်ဟု မြင်မက်မူ လာဘ်ရအံ့။ အလွန်ကြီးသော ကျွဲ၊ နွားမြင်မက်မူ အလွန်ကောင်းအံ့။"),
            (26,"အပုပ်အစပ်ကို မြင်မက်မူ လာဘ်ရအံ့"),
            (27,"အူအပြင်ထွက်သည်ဟု မြင်မက်မူ ကျော်စောအံ့"),
            (28,"အသီးရှိသော သစ်ပင်သို့ တက်ရသည်ဟု မြင်မက်မူ ချမ်းသာအံ့"),
            (29,"အောက်ရှေ့သွားကျိုးသည်ဟု မြင်မက်မူ မကောင်း"),
            (30,"အသီးရှိသော သရက်ပင်၊ ဥသျှစ်ပင်တို့ကို မြင်မက်မူဥစ္စာတိုးပွားအံ့။"),
            (31,"အခိုးအလျှံတောင်သော မီးပုံကို မြင်မက်မူ လာဘ်ရအံ့"),
            (32,"အသံသည်းစွာ ငိုကြွေးရ မြင်မက်မူ ထင်ရှားအံ့"),
            (33,"အသံသည်းစွာ ငိုကြွေးရ မြင်မက်မူ ထင်ရှားအံ့"),
            (34,"အနှောင်အဖွဲ့ မြင်မက်မူ ဥစ္စာရအံ့အလွန်ကောင်းအံ့။"),
            (35,"အပုပ်စား မြင်မက်မူ လာဘ်ရအံ့မကောင်း။"),
        ]
    
   
    
    let blogDetailData_27: [(Int, String)] = [
            (1, "ဥအမျိုးမျိုးစားရသည်ဟု မြင်မက်မူ သူတစ်ပါး အပူဇော်ခံရအံ့"),
            (2, "ဥဗျိုင်းဝန်းရံသည်ဟု မြင်မက်မူ သူတစ်ပါး အပူဇော်ခံရအံ့"),
            (3, "ဥဒေါင်းသံကို ကြားရသည်ဟု မြင်မက်မူသတင်းကောင်းကြားရအံ့။"),
            (4, "ဥယျာဉ်ခြံတို့ကို မြင်မက်မူ လာဘ်ရအံ့"),
            (5, "ဦးထုပ်ဆောင်းရသည်ဟု မြင်မက်မူ ချမ်းသာအံ့"),
            (6, "ဦးခေါင်းထက်၌ ကြာညိုရောက်သည်ဟု မြင်မက်မူမယားကောင်းရအံ့။"),
            (7, "ဦးခေါင်းအပိုရသည်ဟု မြင်မက်မူ နာဖျားအံ့"),
            (8,"ဦးခေါင်းပြတ်သည်ဟု မြင်မက်မူ သေတတ်အံ့"),
            (9,"ဦးခေါင်းကြီးသည်ဟု မြင်မက်မူ မိဘ၊ ဆရာသမားတို့ကြီးပွားခြင်းသို့ ရောက်အံ့။"),
            (10,"ဦးခေါင်းဦးခေါင်းရှည်သည်ဟု မြင်မက်မူ ဆွေမျိုးရောက်အံ့"),
            (11,"ဦးခေါင်းပွန်းပဲ့သည်ဟု မြင်မက်မူ မိဘ၊ ဆရာသမားတို့ကြီးပွားခြင်းသို့ ရောက်အံ့။"),
            (12,"ဦးခေါင်းကွဲသည်ဟု မြင်မက်မူ မကောင်း"),
            (13,"ဦးခေါင်းရှည် မြင်မက်မူ ဆွေများရောက်အံ့၊ ပြန်ပွားအံ့"),
        ]
   
    
    var body: some View {
        VStack {
            
            if(blogId==1){
                List {
                    ForEach(blogDetailData_1, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==2){
                List {
                    ForEach(blogDetailData_2, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==3){
                List {
                    ForEach(blogDetailData_3, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==4){
                List {
                    ForEach(blogDetailData_4, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            
            else if(blogId==5){
                List {
                    ForEach(blogDetailData_5, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==6){
                List {
                    ForEach(blogDetailData_6, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==7){
                List {
                    ForEach(blogDetailData_7, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==8){
                List {
                    ForEach(blogDetailData_8, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==9){
                List {
                    ForEach(blogDetailData_9, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==10){
                List {
                    ForEach(blogDetailData_10, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            
            else if(blogId==11){
                List {
                    ForEach(blogDetailData_11, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==12){
                List {
                    ForEach(blogDetailData_12, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==13){
                List {
                    ForEach(blogDetailData_13, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==14){
                List {
                    ForEach(blogDetailData_14, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==15){
                List {
                    ForEach(blogDetailData_15, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==16){
                List {
                    ForEach(blogDetailData_16, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==17){
                List {
                    ForEach(blogDetailData_17, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==18){
                List {
                    ForEach(blogDetailData_18, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==19){
                List {
                    ForEach(blogDetailData_19, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==20){
                List {
                    ForEach(blogDetailData_20, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
        
            else if(blogId==21){
                List {
                    ForEach(blogDetailData_21, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==22){
                List {
                    ForEach(blogDetailData_22, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==23){
                List {
                    ForEach(blogDetailData_23, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==24){
                List {
                    ForEach(blogDetailData_24, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==25){
                List {
                    ForEach(blogDetailData_25, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==26){
                List {
                    ForEach(blogDetailData_26, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            else if(blogId==27){
                List {
                    ForEach(blogDetailData_27, id: \.0) { item in
                        BlogDetailItemView(item: item)
                    }
                }
            }
            
            
        }
        .padding()
        .navigationTitle("အိပ်မက်များအသေးစိတ်")
    }
}

struct BlogDetailItemView: View {
    let item: (Int, String)

    var body: some View {
        VStack(alignment: .leading) {
            Text(item.1)
                .font(.body)
        }
        .padding()
    }
}
